app/controllers/pins_controller.rb

INSERT INTO "pins" ("body", "created_at", "description", "updated_at") VALUES (?, ?, ?, ?)  [["body", "is it working?"], ["created_at", "2014-11-04 15:07:44.923066"], ["description", "even newer pin"], ["updated_at", "2014-11-04 15:07:44.923066"]]
---
  def create
    @pin = Pin.new(pin_params)
    if @pin.save

UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = 1  [["description", "Informe de muestreo"], ["updated_at", "2014-10-27 02:53:07.361669"]]
---
  def update
    if @pin.update(pin_params)

DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 1]]
---
  def destroy
    @pin.destroy

SELECT  "pins".* FROM "pins"  WHERE "pins"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pin
      @pin = Pin.find(params[:id])